app/controllers/students_controller.rb

  def create
    @student = Student.new(params.require(:student))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-09-25 04:39:07.822565"], ["updated_at", "2018-09-25 04:39:07.822565"]]

  def update
    @student = Post.find(params[:id])
    @student.update(params.require(:post).permit(:title))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-25 04:55:13.222083"], ["id", 1]]